data/00_cases/vortexmerger/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

boundaryField
{	
    top
    {
        type            slip;
    }

    down
    {
        type            slip;
    }
	
	left
    {
        type            slip;
    }
	
	right
    {
        type            slip;
    }

    frontAndBack
    {
        type            empty;
    }
}

internalField nonuniform List<vector>
9801
(
(0.3438875641868282 -0.3058744523937047 0.0)
(0.3463058246923516 -0.32129040445010804 0.0)
(0.3480923441630902 -0.33656760976647726 0.0)
(0.3492695184247429 -0.3516923482244576 0.0)
(0.349858212205212 -0.3666520110973019 0.0)
(0.34987793239502835 -0.3814348585886291 0.0)
(0.3493469979219452 -0.396029837063941 0.0)
(0.34828270047298926 -0.41042643335394985 0.0)
...
);



// ************************************************************************* //
