data/00_cases/vortexmerger/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    frontAndBack
    {
        type            empty;
        physicalType    empty;
        nFaces          19602;
        startFace       19404;
    }
    down
    {
        type            patch;
        physicalType    patch;
        nFaces          99;
        startFace       39006;
    }
    right
    {
        type            patch;
        physicalType    patch;
        nFaces          99;
        startFace       39105;
    }
    top
    {
        type            patch;
        physicalType    patch;
        nFaces          99;
        startFace       39204;
    }
    left
    {
        type            patch;
        physicalType    patch;
        nFaces          99;
        startFace       39303;
    }
)

// ************************************************************************* //
